ASIGNMENT BASED ON DATA FRAME
USING TITANIC DATA SET

In [18]:
import pandas as pd

In [19]:
# 1. Display the names of all passengers who paid a fare greater than $100
# and were under the age of 30.
df=pd.read_csv('Titanic Dataset.csv')
print(pd.DataFrame(df))

#check how many coloms
# titanic.columns

x=((df['Fare']>=100)&(df['Age']<30)).value_counts()

     PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]

In [28]:
#2. Find the top 5 oldest passengers. What are their names, ages, and
# whether they survived?

df.columns
# Sort by age in descending order and select top 5


top_oldest=df.sort_values(by='Age',ascending=False).head()

#Display required coloums
print(top_oldest[['Name','Age','Survived']])

                                                  Name   Age  Survived
96   Cavendish, Mrs. Tyrell William (Julia Florence...  76.0         1
81                                  Straus, Mr. Isidor  67.0         0
236                           Warren, Mr. Frank Manley  64.0         0
179  Compton, Mrs. Alexander Taylor (Mary Eliza Ing...  64.0         1
305  Crosby, Mrs. Edward Gifford (Catherine Elizabe...  64.0         1